Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེ་དག་འོད་ལས་སྤོས་ཀྱི་འོད་འཕྲོ་དང་། མེ་ཏོག་ཕལ་ཆེན་རྒྱ་མཚོའི་སྤྲིན་ཀྱང་འབྱུང་། །
en: From their light there issue forth vast clouds Of oceans of perfumes, light rays, and flowers.

source: མཁའ་ལྟར་ཚད་མྱེད་རིན་ཆེན་གཞལ་མེད་ཁང་། །མ་ལུས་རྒྱན་རབ་ཀུན་གྱིས་རྣམ་མཛེས་པ། །
en: {20} “The precious divine palaces as immeasurable as space Are beautified with every adornment without exception.

source: དེ་དག་ཐམས་ཅད་ཕྱོགས་རྣམས་ཀུན་ཁྱབ་བྱེད། །ཞིང་དང་སྙིང་པོ་བྱང་ཆུབ་དེ་བཞིན་ནོ། །
en: Those realms and their bodhimaṇḍas Pervade every direction.

source: དུས་གསུམ་བྱུང་བའི་རྒྱལ་བའི་སྲས་རྣམས་ཀྱིས། །ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པའི་རྣམ་ཚུལ་དུ། །ཞིང་རྣམས་རྒྱ་མཚོ་རྣམ་པར་དག་བྱས་པའི། །རྒྱན་རབ་སྣ་ཚོགས་འགྲོ་ལྟར་ཚད་མྱེད་པ། །ཕྱོགས་རྣམས་དུས་གསུམ་ཀུན་ཏུ་གང་བྱུང་རྣམས། །
en: {21} “The sugatas’ sons who appear in the three times Purify the ocean of realms Through the practice of completely good conduct, And their various displays, as limitless as beings, {22} “Fill all directions and the three times.

source: བསྐལ་པ་རྒྱ་མཚོ་ཆེན་པོར་རྣམ་སྦྱངས་པ། །དེ་དག་ཀུན་ཀྱང་ཛེ་ཏའི་ནགས་ཚལ་གྱི། །བར་སྣང་མཁའ་ལ་གཟུགས་བརྙན་ཚུལ་དུ་སྣང་། །
en: They have been purified in a great ocean of kalpas, And they all appear like reflections In the expanse of the sky above Jetavana.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་གྱིས། རྒྱུད་ཤིན་ཏུ་སྣང་བར་བྱས་པ་དེ་དག་ལས།
en: {23} Those bodhisattvas were continuously illumined by the samādhi of the Buddha.

source: བྱང་ཆུབ་སེམས་དཔའ་རེ་རེས་ཀྱང་། སྙིང་རྗེ་ཆེན་པོའི་སྒོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དུ་ཞུགས་པར་གྱུར་ནས། དེ་དག་དེ་བས་ཀྱང་འགྲོ་བ་ཐམས་ཅད་ལ་ཕན་པ་དང་། ཡོངས་སུ་བསྡུ་བའི་དོན་དུ་ཞུགས་པར་གྱུར་ཏེ། དེ་ལྟར་མཉམ་པར་བཞག་པ་དེ་དག་གི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་།
en: Each of those bodhisattvas had entered gateways of great compassion as numerous as the atoms in innumerable buddha realms and brought even more benefit for beings.

source: འོད་ཟེར་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མངོན་པར་འཐོན་པ་གྱུར་ཏེ། འོད་ཟེར་དེ་དག་གི་སྒོ་རེ་རེ་ནས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་འཕྲུལ་བའི་སྤྲིན་འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་དང་འདྲ་བའི་ལུས་དང་། འགྲོ་བ་ཐམས་ཅད་ལ་མངོན་པར་ལྟ་བའི་ལུས་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་།
en: Resting in meditation in that way there issued from each of their body hairs light rays as numerous as the atoms in innumerable buddha realms, and from the tips of each of those light rays there issued clouds of bodhisattvas’ emanations, emanated bodies that resembled the bodies of the Indras of all worlds, bodies that looked upon all beings and ripened all beings.

source: འཕྲོད་པའི་ལུས་དང་ལྡན་པ་མངོན་པར་འཐོན་ཏེ། མངོན་པར་འཐོན་ནས་ཀྱང་། ཕྱོགས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་བཀང་ནས།
en: Having issued forth, they pervaded the realm of phenomena in all directions.

source: སེམས་ཅན་ཐམས་ཅད་ཡང་དག་པར་བསྐུལ་ཞིང་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བར་བྱེད་དོ། །ལྷའི་གནས་ན་ཤི་འཕོ་བ་ཡོངས་སུ་བསྟན་པའི་སྒོ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་སྐྱེ་བ་ཡོངས་སུ་བསྟན་པའི་སྒོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ཡོངས་སུ་བསྟན་པའི་སྒོ་དང་། རྨི་ལམ་ཡོངས་སུ་བསྟན་པའི་སྒོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་བསྐུལ་བ་བྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱིས་བྱུང་བའི་སྒོ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་བསྐྱོད་པའི་སྒོ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ཡོངས་སུ་བསྟན་པའི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་ལ་ནན་ཏན་དུ་བྱ་བ་དང་། རབ་ཏུ་བསྒྲུབ་པའི་སྒོ་དང་།
en: They inspired all beings, ripened them, and guided them.

source: ཡན་ལག་དང་ཉིང་ལག་གཅོད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བསྟན་པའི་སྒོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོས་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བསྟན་པའི་སྒོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་དང་རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་ལམ་གྱི་དཀྱིལ་འཁོར་སྣང་བ་རབ་ཏུ་བརྗོད་པའི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བའི་ཕྱིར། ཆོས་ཀྱི་ཚིག་དང་ཡི་གེ་རེ་རེའི་ཕྱིར། ལུས་གྲངས་མེད་པ་ཡོངས་སུ་གཏང་བ་ཡོངས་སུ་བསྟན་པའི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དྲུང་དུ་འགྲོ་ཞིང་ཆོས་ཐམས་ཅད་ཡོངས་སུ་དྲི་བའི་སྒོ་དང་། དུས་ལ་ཇི་ལྟར་འབབ་པ་དང་། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་འགྲོ་བའི་དྲུང་དུ་འགྲོ་ཞིང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྨིན་པར་འགྱུར་བ་ཐོབ་པར་བྱ་བའི་ཚུལ་རྒྱ་མཚོ་སྣང་བའི་རྣམ་པར་དམྱིགས་པར་བྱ་བའི་སྒོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཐམས་ཅད་བདུད་དང་། ཕས་ཀྱི་རྒོལ་བས་མྱི་ཚུགས་པའི་སྟོབས་ཀྱི་རྒྱལ་མཚན་ཡོངས་སུ་བསྟན་པའི་སྒོ་དང་། བཟོ་ཐམས་ཅད་ཤེས་ཤིང་མཁས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་ཡོངས་སུ་བསྟན་པའི་སྒོ་དང་། འགྲོ་བ་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པར་ཤེས་ཤིང་མཁས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་ཡོངས་སུ་བསྟན་པའི་སྒོ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པའི་ཁྱད་པར་ཤེས་ཤིང་མཁས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་ཡོངས་སུ་བསྟན་པའི་སྒོ་དང་།
en: They inspired beings with the gateways that taught being reborn in paradises after death; with the gateways that taught rebirth in all world realms; with the gateways that taught the domain of bodhisattva conduct; with the gateways that taught dreams, which were as numerous as the atoms in innumerable buddha realms; with the gateways that arose from aspirations of all bodhisattvas; with the gateways that shook the world realms; with the gateways that taught the conduct of the perfection of generosity; with the gateways that were dedicated to and accomplished the qualities of all the tathāgatas; with the gateways that taught the perfection of patience when one’s limbs and various body parts are cut off; with the gateways that taught the perfection of diligence through the great miracles of the bodhisattvas; with the gateways that described the dhyānas, liberations, and samādhis of the bodhisattvas and the radiance of the domain that is the path of the wisdom of the buddhas; with the gateways that taught the sacrificing of countless bodies for the sake of seeking all the Dharmas of the buddhas and for the sake of each word and letter of the Dharma; with the gateways of going into the presence of all the tathāgatas and asking questions concerning all the Dharmas; with the gateways of being focused on the radiance of an ocean of the ways of attaining going into the presence of beings when the time is right and, in accordance with their aspirations, ripening them for omniscience; with the gateways that teach the victory banner of the power of the invincibility of the merit and wisdom of bodhisattvas in the face of māras and adversaries; with the gateways that teach the level of the wisdom that has knowledge and understanding of all crafts; with the gateways that teach the level of knowledge and understanding that is superior to that of all beings; with the gateways that teach the level of the wisdom that has the knowledge and understanding of the different aspirations of all beings; with the gateways that teach the level of the wisdom that has the knowledge and understanding of the capabilities, entrances, engagements, and various kleśas and predispositions of all beings; and with the gateways that teach the level of the wisdom that has the knowledge and understanding of the variety of karma and practices of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་ལ་འཇུག་པའི་ཐབས་ཀྱིས་ཉོན་མོང་པ་དང་། བག་ཆགས་སྣ་ཚོགས་ཡང་དག་པར་གཞོམ་པ་ལ་ཤེས་ཤིང་མཁས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་ཡོངས་སུ་བསྟན་པའི་སྒོ་དང་། དེ་དག་ལ་སྩོགས་པ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་ཐབས་དང་བསྡུ་བའི་སྒོ། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་སུ་ཕྱིན་པར་སྣང་སྟེ།
en: With other such gateways as numerous as the atoms in innumerable buddha realms that contained methods for ripening and guiding beings, those bodhisattvas went to the abodes of all beings and appeared there.

source: ལ་ལ་ནི་ལྷའི་གནས་སུ་ཕྱིན་པར་སྣང་ངོ་། །
en: Some went to the abodes of devas and appeared there.

source: ལ་ལ་ནི་ཀླུའི་གནས་སུ་ཕྱིན་པར་སྣང་ངོ་། །
en: Some went to the abodes of nāgas and appeared there.

source: ལ་ལ་ནི་གནོད་སྦྱིན་གྱི་གནས་སུ་ཕྱིན་པར་སྣང་ངོ་། །
en: Some went to the abodes of yakṣas and appeared there.

source: ལ་ལ་ནི་དྲི་ཟའི་གནས་སུ་ཕྱིན་པར་སྣང་ངོ་། །
en: Some went to the abodes of gandharvas and appeared there.

source: ལ་ལ་ནི་ལྷ་མ་ཡིན་གྱི་གནས་སུ་ཕྱིན་པར་སྣང་ངོ་། །
en: Some went to the abodes of asuras and appeared there.

source: ལ་ལ་ནི་ནམ་མཁའ་ལྡིང་གི་གནས་སུ་ཕྱིན་པར་སྣང་ངོ་། །
en: Some went to the abodes of garuḍas and appeared there.

source: ལ་ལ་ནི་མི་འམ་ཅིའི་གནས་སུ་ཕྱིན་པར་སྣང་ངོ་། །
en: Some went to the abodes of kinnaras and appeared there.

source: ལ་ལ་ནི་ལྟོ་འཕྱེ་ཆེན་པོའི་གནས་སུ་ཕྱིན་པར་སྣང་ངོ་། །
en: Some went to the abodes of mahoragas and appeared there.

source: ལ་ལ་ནི་ཚངས་པའི་དབང་པོའི་གནས་སུ་ཕྱིན་པར་སྣང་ངོ་། །
en: Some went to the abodes of the lords of Brahmā deities and appeared there.

source: ལ་ལ་ནི་མིའི་གནས་སུ་ཕྱིན་པར་སྣང་ངོ་། །
en: Some went to the abodes of humans and appeared there.

source: ལ་ལ་ནི་གཤིན་རྗེའི་གནས་སུ་ཕྱིན་པར་སྣང་ངོ་། །
en: Some went to the realms of Yamas and appeared there.

source: ལ་ལ་ནི་ཡི་དགས་ཀྱི་གནས་ཐམས་ཅད་དུ་ཕྱིན་པར་སྣང་ངོ་། །
en: Some went to all the abodes of pretas and appeared there.

source: ལ་ལ་ནི་སེམས་ཅན་དམྱལ་བའི་འཇིག་རྟེན་ཐམས་ཅད་དུ་ཕྱིན་པར་སྣང་ངོ་། །
en: Some went to the worlds of the hells and appeared there.

source: ལ་ལ་ནི་ཡི་དགས་ཀྱི་སྐྱེ་གནས་ཀྱི་རྒྱུད་ཐམས་ཅད་དུ་ཕྱིན་པར་སྣང་སྟེ། མཐོང་བས་འདུལ་བའི་སེམས་ཅན་དང་། ཐོས་པས་འདུལ་བ་དང་རྗེས་སུ་དྲན་པས་འདུལ་བ་དང་། དབྱངས་ཀྱི་དཀྱིལ་འཁོར་གྱིས་འདུལ་བ་དང་།
en: Some went to births as animals and appeared there.

source: མྱིང་གི་ཆུ་ཀླུང་གི་སྒྲས་འདུལ་བ་དང་། འོད་ཀྱི་དཀྱིལ་འཁོར་གྱིས་འདུལ་བ་དང་། འོད་ཟེར་གྱི་དྲ་བ་རབ་ཏུ་དགྱེ་བས་འདུལ་བ་དང་། སེམས་ཅན་རྣམས་ཀྱི་བསམ་པའི་ཚུལ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོ་ཐ་མྱི་དད་པ་དང་སྨོན་ལམ་ཐ་མི་དད་པ་དང་ཡེ་ཤེས་ཐ་མྱི་དད་པ་དང་། སེམས་ཅན་ཡོངས་སུ་བསྡུ་བ་ཐ་མྱི་དད་པའི་ཚུལ་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཛེ་ཏའི་ཚལ་ནས་རྣམ་པར་འཕྲུལ་པའི་རྒྱན་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་དུ་རྒྱས་པར་འགེངས་པར་བྱེད་པར་སྣང་ཡང་དེ་བཞིན་གཤེགས་པའི་ཞབས་ཀྱི་དྲུང་ནས་མྱི་གཡོ་སྟེ།
en: In order to ripen and guide with undivided great compassion, with undivided aspiration, with undivided wisdom, with an undivided attraction of beings, and in accordance with the aspirations of beings, those beings who are guided by seeing them, guided by hearing them, guided by remembering them, guided by the scope of their voices, guided by the sound of the river of their names, guided by their halos, or guided by their emanating a net of light rays—those bodhisattvas in Jetavana filled with an array of various emanations the entire extent of world realms and the entire extent of the realms of beings without moving from the feet of the Tathāgata.

source: ལ་ལ་ནི་རང་གི་གནས་དང་ཁང་པ་བརྩེགས་པ་དང་། སྟན་དང་འཁོར་དང་བཅས་པས། ཕྱོགས་བཅུ་རྒྱས་པར་བྱེད་པར་སྣང་ཡང་། དེ་བཞིན་གཤེགས་པའི་ཞབས་ཀྱི་དྲུང་ནས་མྱི་གཡོའོ། །
en: Some made their own dwellings, kūṭāgāras, thrones, and retinues appear throughout the ten directions without moving from the feet of the Tathāgata.

source: ལ་ལ་ནི་སྤྲུལ་པའི་སྤྲིན་རབ་ཏུ་འགྱེད་པར་སྣང་ངོ་། །ལ་ལ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དོན་དུ་གཅིག་པུ་གཉིས་སུ་མྱེད་པར་འགྲོ་བར་སྣང་ཡང་། དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ནས་མྱི་གཡོའོ། །ལ་ལ་ནི་དགེ་སྦྱོང་གི་གཟུགས། ལ་ལ་ནི་ཚངས་པའི་གཟུགས། །ལ་ལ་ནི་བརྟུལ་ཞུགས་ཅན་ཐམས་ཅད་ཀྱི་ཆ་བྱད་དང་། ཆོ་ག་དང་ཆུ་ཞེང་གི་གཟུགས། ལ་ལ་ནི་སྨན་པའི་གཟུགས།
en: Some sent forth clouds of emanations, while some appeared to go alone, with no companion, in order to ripen beings, without moving from the circle of the Tathāgata’s entourage.

source: ལ་ལ་ནི་ཚོང་པའི་གཟུགས། ལ་ལ་ནི་སྙན་པས་འཚོ་བའི་གཟུགས། ལ་ལ་ནི་གར་མཁན་གྱི་གཟུགས། ལ་ལ་ནི་ལྷ་ཁྱེར་བའི་གཟུགས། ལ་ལ་ནི་བཟོ་ཐམས་ཅད་དང་ལྡན་པའི་གཟུགས་སུ་གྲོང་དང་གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཁམས་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དུ་ཕྱིན་པར་སྣང་སྟེ།
en: Some appeared in the form of śramaṇas, some in the form of Brahmās, some in the form of those adorned all over with all emblems, some in the form of physicians, some in the form of merchants, some in the form of disciples, some in the form of dancers, some in the form of devotees to deities, and some in the form of those skilled in all crafts, all of them appearing in villages, towns, market towns, regions, and capitals.

source: དུས་ཀྱི་དབང་གིས་དུས་ཀྱི་རྗེས་སུ་འབྲང་ཞིང་མྱིང་དང་གཟུགས་དང་ལུས་མངོན་པར་བསྒྲུབ་པ་ཐ་དད་པ་དང་། ལུས་ཀྱི་ཁ་དོག་དང་དབྱིབས་ཚུལ་དང་འདྲ་བ་དང་དབྱངས་རྣམ་པ་ཐ་དད་པ་དང་། སྐད་རྣམ་པ་ཐ་དད་པ་དང་། སྤྱོད་ལམ་རྣམ་པ་ཐ་དད་པ་དང་། གནས་རྣམ་པ་ཐ་དད་པས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། འགྲོ་བ་ཐམས་ཅད་མྱིག་འཕྲུལ་ལྟ་བུར་ཤེས་པ་དང་། བཟོའི་འཁོར་ཐམས་ཅད་རབ་ཏུ་བརྗོད་པ་དང་།
en: They appeared at the times that were the appropriate times, assuming different appropriate bodies, with different colors and body shapes, different voices, different languages, different kinds of conduct, and different kinds of residence.

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཤེས་པ་བརྗོད་པས་སྣང་བའི་སྒྲོན་མ་དང་། བདེ་བ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་བརྒྱན་པ་དང་། ལས་ཐམས་ཅད་སྣང་བར་བྱེད་པའི་འོད་དང་ལྡན་པ་དང་། ཕྱོགས་ཐམས་ཅད་ཐེག་པ་ལ་གནས་པས་རབ་ཏུ་སྦྱོང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཆོས་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྣང་བ་ལ་སྤྱོད་ཅིང་།
en: They practiced the bodhisattva conduct in which all beings are known to be illusions, which illuminated the entire realm of crafts, which was a bright lamp that revealed the knowledge of all beings, which was adorned with the blessing of all truths, which had the light that illuminated all Dharmas, and which purified beings in the yānas in all directions, and they practiced the bodhisattva conduct that illuminated the entire domain of the Dharma.

source: སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བའི་དོན་དུ་གྲོང་དང་གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་ལྗོངས་དང་། ཁམས་དང་། རྒྱལ་པོའི་གནས་དག་དུ་ཕྱིན་པར་སྣང་ངོ་། །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་གནས་པ་མྱེད་པའི་ཁང་པ་བརྩེགས་པ་ན་འདུག་འདུག་པ་ལས་སྐལ་བ་མཐུན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། རྟག་ཏུ་ཕྱི་བཞིན་འབྲང་བའི་ལག་ན་རྡོ་རྗེ་དག་དང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་ཉམས་བལྟ་བ་ལ་བརྩོན་ཞིང་སངས་རྒྱས་ཐམས་ཅད་བསྙེན་བཀུར་བར་སྨོན་པའི་སེམས་དང་ལྡན་པའི་ལུས་ཀྱི་རིས་སུ་གཏོགས་པའི་ལྷ་དག་དང་། སྔོན་གྱི་སྨོན་ལམ་གྱི་རྗེས་སུ་འབྲང་བའི་རྐང་གིས་འགྲོ་བའི་རིས་སུ་གཏོགས་པའི་ལྷ་དག་དང་། ཆོས་མཉན་པ་ལ་མངོན་པར་མོས་པའི་སའི་ལྷ་དག་དང་། སྙིང་རྗེ་ཆེན་པོ་ལ་བརྩོན་པའི་ལུ་མ་དང་། མཚོ་དང་མཚེའུ་དང་། རྫིང་བུ་དང་ཁྲོན་པ་དང་། ཆུ་ཀླུང་གི་ལྷ་དག་དང་། ཤེས་རབ་ཀྱི་འོད་སྣང་བས་རབ་ཏུ་གསལ་བའི་མེའི་ལྷ་དག་དང་། རིན་པོ་ཆེའི་ཅོད་པན་ཐོགས་པའི་རླུང་གི་ལྷ་དག་དང་། ཆོས་ཀྱི་ཕྱོགས་སྣང་བ་ཁོང་དུ་ཆུད་པའི་ཕྱོགས་ཀྱི་ལྷ་དག་དང་། མ་རིག་པའི་མུན་པ་བསལ་བ་ལ་བརྩོན་པའི་མཚན་མོའི་ལྷ་དག་དང་།
en: In order to ripen and guide beings, they appeared in villages, towns, market towns, regions, and capitals.

source: དེ་བཞིན་གཤེགས་པའི་ཉི་མ་མངོན་པར་བསྒྲུབ་པ་ལ་བརྩོན་པའི་ཉི་མའི་ལྷ་དག་དང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ཀྱི་ནམ་མཁའ་བརྒྱན་པ་ལ་བརྩོན་པའི་ནམ་མཁའི་ལྷ་དག་དང་། འགྲོ་བ་ཐམས་ཅད་སྲིད་པའི་རྒྱ་མཚོ་ལས་བསྒྲལ་བར་བརྩོན་པའི་གང་ཆེན་མཚོའི་ལྷ་དག་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཚོགས་ཡང་དག་པར་བསྩགས་པ་ལ་བརྩོན་ཞིང་། དགེ་བའི་རྩ་བའི་སྤོ་མངོན་པར་འཕགས་པའི་སེམས་དང་ལྡན་པའི་རིའི་ལྷ་དག་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་ལུས་བརྒྱན་པར་བརྩོན་ཞིང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཁ་དོག་དང་བྱིན་གྱི་རླབས་ལ་སྨོན་ཅིང་བརྩོན་པའི་ཆུ་ཀླུང་གི་ལྷ་དག་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་གྲོང་རྡལ་ཡོངས་སུ་བསྐྱང་བར་བརྩོན་པའི་གྲོང་གི་ལྷ་དག་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཆོས་ཀྱི་གྲོང་ཁྱེར་དུ་སྨོན་ཅིང་མོས་པའི་ཀླུའི་དབང་པོ་དག་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྲུང་བ་ལ་ཞུགས་པའི་གནོད་སྦྱིན་གྱི་དབང་པོ་དག་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགའ་བའི་ཤུགས་རྣམ་པར་འཕེལ་བར་བྱ་བ་ལ་བརྩོན་པའི་དྲི་ཟའི་དབང་པོ་དག་དང་། ཡི་དགས་ཀྱི་རྒྱུད་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་ལ་བརྩོན་པའི་གྲུལ་བུམ་གྱི་དབང་པོ་དག་དང་། སེམས་ཅན་ཐམས་ཅད་སྲིད་པའི་རྒྱ་མཚོ་ནས་གདོན་པའི་སྨོན་ལམ་གྱིས་ཞུགས་པའི་ནམ་མཁའ་ལྡིང་གི་དབང་པོ་དག་དང་། འཇིག་རྟེན་ཐམས་ཅད་ལས་འཕགས་པའི་དེ་བཞིན་གཤེགས་པའི་སྐུ་དང་། སྟོབས་ཡོངས་སུ་བསྒྲུབ་པར་སྨོན་ལམ་ཡོངས་སུ་བསྐྱེད་པའི་ལྷ་མ་ཡིན་གྱི་དབང་པོ་དག་དང་། དེ་བཞིན་གཤེགས་པ་མཐོང་བས་དགའ་བར་གྱུར་ཅིང་། ལུས་རབ་ཏུ་འདུད་པའི་ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་དག་དང་། འཁོར་བ་ལས་སྐྱོ་བའི་ཡིད་དང་ལྡན་ཞིང་ངོར་བལྟ་བའི་ལྷའི་དབང་པོ་དག་དང་།
en: Mañjuśrī Chapter 3 Mañjuśrī Kumāra­bhūta was residing in his kūṭāgāra together with bodhisattvas who had the same conduct; vajrapāṇis who constantly followed him; devas with physical bodies whose minds aspired to serve all the buddhas and were dedicated to bringing power to the entire world; devas who walked on foot following their past aspirations; devas of the earth who aspired to hear the Dharma; devas of pools, lakes, ponds, reservoirs, wells, and rivers who were dedicated to great compassion; devas of fire who brought illumination through the light of wisdom; devas of the air who wore precious crowns; devas of the directions who illuminated the directions with wisdom; devas of the night who were dedicated to eliminating the darkness of ignorance; devas of the day who were dedicated to producing the daylight of the tathāgatas; devas of the sky who were dedicated to orbiting in the sky of the entire realm of phenomena; devas of the ocean who were dedicated to rescuing beings from the ocean of existence; devas of mountains who were dedicated to gathering the accumulation of omniscience and whose minds had ascended to the summit of the roots of merit; devas of rivers who were dedicated to adorning all beings and who were dedicated to aspiring to the characteristics and supernatural power of all the buddhas; devas of towns who were dedicated to caring for the towns that are the minds of all beings; nāga lords who were devoted to and longed for the town of the omniscient Dharma; yakṣa lords who were engaged in protecting all beings; gandharva lords who were dedicated to increasing the power of joy in all beings; kumbhāṇḍa lords who were dedicated to preventing rebirth as pretas; garuḍa lords who were engaged in aspiring to bring all beings out of the ocean of existence; asura lords who had the aspiration to attain the body and power of the Tathāgata, which have transcended the entire world; mahoraga lords who rejoiced in seeing the Tathāgata and bowed down to him; deva lords who had been saddened by saṃsāra and gazed with admiration; and lords of Brahmakāyika devas who bowed down with great respect.

source: རིམ་གྲོ་ཆེན་པོ་རབ་ཏུ་བྱེད་ཅིང་ལུས་རབ་ཏུ་འདུད་པའི་ཚངས་པའི་དབང་པོ་དག་དང་། ལྷན་ཅིག་ཏུ་དེ་དག་གིས་རིམ་གྲོ་ཆེན་པོས་མངོན་པར་བསྟོད་དེ་མཆོད་ཅིང་། དེ་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་གནོན་པའི་རྒྱན་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པར་རང་གི་གནས་ནས་བྱུང་སྟེ།
en: Mañjuśrī, together with them, displaying the prowess of a bodhisattva, respectfully made praises and offerings.

source: བཅོམ་ལྡན་འདས་ལ་གཡས་ཕྱོགས་སུ་བསྐོར་བ་ལན་བརྒྱ་ཕྲག་དུ་མ་ཞིག་ཏུ་བྱས་ནས། མཆོད་པ་རྣམ་པ་དུ་མས་མཆོད་དེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་ཕྱིར་བྱུང་ནས།
en: Then he came out of his abode and circumambulated the Bhagavat many hundreds of times, keeping him to his right, and made many offerings.

source: ལྷོ་ཕྱོགས་ལོགས་སུ་ཡུལ་རྒྱུ་ཞིང་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་ཉི་ཤུ་བདུན་པ།
en: He then left the presence of the Bhagavat and departed to the land of the southern region.

source: དེ་ནས་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས། ཚེ་དང་ལྡན་པ་ཤར་དྭ་ཏིའི་བུས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱན་ཕུན་སུམ་ཚོགས་པ་དེ་འདྲ་བས། ཛེ་ཏའི་ཚལ་ནས་བྱུང་སྟེ། ལྷོ་ཕྱོགས་ལོགས་སུ་འགྲོ་བ་མཐོང་ནས།
en: Through the blessing of the Buddha, Brother Śāriputra saw Mañjuśrī Kumāra­bhūta, who, with that display of bodhisattva miracles, departed from Jetavana and went to the southern region.

source: དེ་འདི་སྙམ་དུ་གྱུར་ཏེ། བདག་ཀྱང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་ལྷན་ཅིག་ཏུ་ཡུལ་རྒྱུ་ཞིང་འགྲོའོ་སྙམ་ནས།
en: He thought, “I will go with Mañjuśrī Kumāra­bhūta to that land.”

source: དེ་དགེ་སློང་དྲུག་ཅུ་ཙམ་གྱིས་བསྐོར་ཅིང་མདུན་དུ་བྱས་ཏེ། རང་གི་གནས་ནས་བྱུང་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། བཅོམ་ལྡན་འདས་ལ་ཞུས་ཏེ།
en: Leading his following of sixty bhikṣus, he left where he was sitting, approached the Bhagavat, bowed his head to the Bhagavat’s feet, and asked for the Bhagavat’s permission.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གནང་བ་དང་། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་དུ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་ཕྱིར་བྱུང་སྟེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་གང་ན་བ་དེར་དགེ་སློང་ལྷན་ཅིག་ཏུ་སྤྱོད་པ་རབ་ཏུ་བྱུང་ནས་རིང་པོ་མ་ལོན་པར་གསར་དུ་ཞུགས་པ་ཤ་སྟག་སྟེ། འདི་ལྟར་དགེ་སློང་རྒྱ་མཚོའི་བློ་དང་། ལེགས་པར་བྱིན་པ་ཆེན་པོ་དང་། བསོད་ནམས་ཀྱི་འོད་དང་། བུ་ཆེན་པོ་དང་ཀུན་ཁྱབ་སྦྱིན་པ་དང་། རྣམ་དག་སྤྱོད་པ་དང་།
en: When the Bhagavat had given it, Śāriputra circumambulated him three times, left the presence of the Bhagavat, and went to where Mañjuśrī Kumāra­bhūta had gone, together with his following of sixty bhikṣus who had all newly and not long before entered homelessness.

source: ལྷའི་དཔལ་དང་། དབང་པོའི་བློ་གྲོས་དང་། ཚངས་པའི་དམ་པ་དང་། དགེ་སློང་ཞི་བའི་བློ་གྲོས་དང་། དེ་དག་ལ་སྩོགས་པའི་དགེ་སློང་དྲུག་ཅུ་ཙམ་ཀུན་ཀྱང་། སྔོན་གྱི་རྒྱལ་བ་ལ་བྱ་བ་བྱས་པ། དགེ་བའི་རྩ་བ་བསྐྱེད་པ། མོས་པ་ཟབ་མོར་གྱུར་པ། དད་པའི་མྱིག་ཡོངས་སུ་དག་པ། སེམས་རྒྱ་ཆེན་པོས་ཡོངས་སུ་སྤྱོད་པ།
en: They were the bhikṣus Sāgara­buddhi, Mahāsudata, Puṇya­prabha, Mahāvatsa, Vibhudatta, Viśuddhacārin, Devaśrī, Indramati, Brahmottama, Praśānta­mati, and others.

source: སངས་རྒྱས་ཀྱི་ཕྱོགས་རྣམ་པར་བལྟ་བ་ལ་མཐུ་ཡོད་པ། ཆོས་ཀྱི་ངོ་བོ་ཉིད་དང་། རང་བཞིན་ངེས་པར་རྟོགས་པའི་སེམས་དང་ལྡན་པ། གཞན་ལ་ཕན་པར་གྱུར་པའི་བློ་ཅན། དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་ལ་མངོན་པར་མོས་པ།
en: They had all served jinas in the past, planted the roots of merit, had profound aspiration, had the purified eyes of faith, practiced with a vast mentality, had the power to see the buddhas in the directions, had realized the nature and character of the Dharma, had the intention to benefit others, aspired to the qualities of the Tathāgata, and had been guided by the Dharma teaching of Mañjuśrī Kumāra­bhūta.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཆོས་བསྟན་པས་འདུལ་བ་ཤ་སྟག་དང་འགྲོགས་ཤིང་མདུན་དུ་བྱས་ཏེ་སྔོན་དུ་བདར་ནས།
en: Leading those followers, Śāriputra went to where Mañjuśrī Kumāra­bhūta had gone.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་གང་ན་བ་དེར་དོང་ངོ་། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་དེ་ལྟར་ལམ་དུ་ཞུགས་ཏེ། འདོང་བའི་ཚེ་དགེ་སློང་དེ་དག་ཀུན་ལ་བལྟས་ནས། དགེ་སློང་རྒྱ་མཚོའི་བློ་ལ་སྨྲས་པ། རྒྱ་མཚོའི་བློ་བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་གྱི་ལུས་མཚན་དང་དཔེ་བྱད་བཟང་པོས་རྣམ་པར་བརྒྱན་ཅིང་།
en: When Brother Śāriputra was on the way, he looked at all those bhikṣus and said to the bhikṣu Sāgara­buddhi, “Sāgara­buddhi, regard the bodhisattva Mañjuśrī upon a path that has a checkerboard pattern and displays of his path as he walks along it.

source: ཡོངས་སུ་དག་པ། ལྷ་དང་མིར་བཅས་པ་བསམ་གྱིས་མྱི་ཁྱབ་པ་དང་།
en: “His pure body is inconceivable to devas and humans. It is beautified by the signs and features of a great being.

source: འོད་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་ཅིང་སེམས་ཅན་ཚད་མྱེད་པའི་དགའ་བ་ཡོངས་སུ་སྐྱེད་པ་དང་།
en: It has a pure halo of light. It emits a display of a network of light rays that brings joy to countless beings.

source: འོད་ཟེར་གྱི་དྲ་བའི་རྒྱན་སེམས་ཅན་དཔག་ཏུ་མྱེད་པའི་སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་བྱེད་པ་དང་།
en: It brings to an end the sufferings of countless beings.

source: འཁོར་ཕུན་སུམ་ཚོགས་པ་སྔོན་གྱི་དགེ་བའི་རྩ་བས་ཡོངས་སུ་བཟུང་བ་དང་།
en: It is accompanied by a perfect entourage, and it is in possession of past roots of merit.

source: ལམ་གྱི་རྒྱན་འགྲོ་ན་ལམ་མྱིག་མངས་རིས་སུ་གནས་པ་དང་ལམ་རྣམ་པར་གནོན་པའི་རྒྱན་ཕྱོགས་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ལ་མངོན་པར་ལྟ་བར་གནས་པ་དང་།
en: “The displays of the prowess of his path are directed toward the domain of every direction; the displays of his perfection of merit issue forth to the right and left as great treasures.

source: བསོད་ནམས་ཕུན་སུམ་ཚོགས་པའི་རྒྱན་གཡས་གཡོན་ནས་གཏེར་ཆེན་པོ་མངོན་པར་འཐོན་པ་དང་སྔོན་གྱི་སངས་རྒྱས་ལ་རིམ་གྲོ་བྱས་པའི་དགེ་བའི་རྩ་བ་དང་རྒྱུ་མཐུན་པས། ཤིང་གི་གསེབ་ཐམས་ཅད་ནས་རྒྱན་མང་པོ་འབྱུང་བ་དང་།
en: “These displays emerge from within all the trees as the result of his roots of merit from serving past buddhas.

source: འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་ལ་མཆོད་པའི་སྤྲིན་གྱི་ཆར་མངོན་པར་འབེབས་ཤིང་བཏུད་དེ་ཕྱག་འཚལ་བ་དང་།
en: All the lords of the world bow down to him and send down a rain of clouds of offerings.
